[
  {
    "id": "cayleyComprehensive2022",
    "abstract": "Additive manufacturing (AM) is a rapidly growing technology within the industry and education sectors. Despite this, there lacks a comprehensive tool to guide AM-novices in evaluating the suitability of a given design for fabrication by the range of AM processes. Existing design for additive manufacturing (DfAM) evaluation tools tend to focus on only certain key process-dependent DfAM considerations. By contrast the purpose of this research is to propose a tool that guides a user to comprehensively evaluate their chosen design and educates the user on an appropriate DfAM strategy. The tool incorporates both opportunistic and restrictive elements, integrates the seven major AM processes and outputs an evaluative score and recommends processes and improvements for the input design. The paper presents a thorough framework for this evaluation tool and details the inclusion of features such as dual-DfAM consideration, process recommendations, and a weighting system for restrictive DfAM. The result is a detailed recommendation output that helps users to determine not only “can you print your design” but also “should you print your design” by combining several key research studies to build a comprehensive user design tool. This research demonstrates the potential of the framework through a series of case studies geometries. The preliminary framework presented in this paper establishes a foundation for future studies to refine the tool’s accuracy using more data and expert analysis.",
    "accessed": { "date-parts": [[2022, 11, 14]] },
    "author": [
      { "family": "Cayley", "given": "Alexander" },
      { "family": "Mathur", "given": "Jayant" },
      { "family": "Meisel", "given": "Nicholas" }
    ],
    "citation-key": "cayleyComprehensive2022",
    "container-title": "Volume 3A: 48th Design Automation Conference (DAC)",
    "DOI": "10.1115/detc2022-90058",
    "event-place": "St. Louis, Missouri, USA",
    "event-title": "ASME 2022 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference",
    "ISBN": "978-0-7918-8622-9",
    "issued": { "date-parts": [[2022, 8, 14]] },
    "license": "All rights reserved",
    "page": "V03AT03A030",
    "publisher": "American Society of Mechanical Engineers",
    "publisher-place": "St. Louis, Missouri, USA",
    "source": "DOI.org (Crossref)",
    "title": "Toward a Comprehensive Framework for Preliminary Design Evaluation in Additive Manufacturing",
    "type": "paper-conference",
    "URL": "https://asmedigitalcollection.asme.org/IDETC-CIE/proceedings/IDETC-CIE2022/86229/V03AT03A030/1150324"
  },
  {
    "id": "dhengreEnhanced2020",
    "abstract": "With an increase in the number of mobile apps making their way to users, there is a growing need for tools to support the app design process. While many tools focus on increasing the pace of development, few attempt to aide the designer in generating more creative solutions. In this work, we take creativity as the combination of novelty and utility. Particularly during development of user interfaces, assessment of utility (primarily usability) is iterative, rigorous, and time-consuming. The objective of the proposed work is to explore and evaluate the use of machine learning to predict usability measures for mobile app interfaces as a means to automate usability evaluations. Speciﬁcally, a convolutional neural network (CNN) is used to accurately (nearly 90%) predict three usability measures: regularity, complexity, and touchability. This tool automates the assessment of utility in app design, freeing up the designer to seek designs that are novel and thus creative.",
    "author": [
      { "family": "Dhengre", "given": "Snehal" },
      { "family": "Mathur", "given": "Jayant" },
      { "family": "Oghazian", "given": "Farzaneh" },
      { "family": "Tan", "given": "Xiaomei" },
      { "family": "McComb", "given": "Christopher" }
    ],
    "citation-key": "dhengreEnhanced2020",
    "event-title": "11th International Conference on Computational Creativity",
    "ISBN": "978-989-54-1602-8",
    "issued": { "date-parts": [[2020, 9]] },
    "language": "en",
    "license": "All rights reserved",
    "page": "4",
    "source": "Zotero",
    "title": "Towards Enhanced Creativity in Interface Design through Automated Usability Evaluation",
    "type": "paper-conference",
    "URL": "http://computationalcreativity.net/iccc20/papers/114-iccc20.pdf"
  },
  {
    "id": "mathurAnalysis2021",
    "abstract": "Although there is a substantial growth in the Additive Manufacturing (AM) market commensurate with the demand for products produced by AM methods, there is a shortage of skilled designers in the workforce that can apply AM effectively to meet this demand. This is due to the innate complications with cost and infrastructure for high-barrier-to-entry AM processes such as powder bed fusion when attempting to educate designers about these processes through in-person learning. To meet the demands for a skilled AM workforce while also accounting for the limited access to the range of AM processes, it is important to explore other mediums of AM education such as computeraided instruction (CAI) which can increase access to hands-on learning experiences. Therefore, the purpose of this paper is to analyze the use of CAI in AM process education and focus on its effects on knowledge gain and cognitive load. Our findings show that when designers are educated about material extrusion and powder bed fusion through CAI, the knowledge gain for powder bed fusion is significantly different than knowledge gain for material extrusion, with no significant difference in cognitive load between these two AM processes. These findings imply that there is potential in virtual mediums to improve a designer’s process-centric knowledge for the full range of AM processes including those that are usually inaccessible. We take these findings to begin developing recommendations and guidelines for the use of virtual mediums in AM education and future research that investigates implications for virtual AM education.",
    "accessed": { "date-parts": [[2022, 10, 18]] },
    "author": [
      { "family": "Mathur", "given": "Jayant" },
      { "family": "Miller", "given": "Scarlett R." },
      { "family": "Simpson", "given": "Timothy W." },
      { "family": "Meisel", "given": "Nicholas A." }
    ],
    "citation-key": "mathurAnalysis2021",
    "container-title": "Volume 4: 18th International Conference on Design Education (DEC)",
    "DOI": "10.1115/detc2021-71667",
    "event-place": "Virtual, Online",
    "event-title": "ASME 2021 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference",
    "ISBN": "978-0-7918-8540-6",
    "issued": { "date-parts": [[2021, 8, 17]] },
    "language": "en",
    "license": "All rights reserved",
    "page": "V004T04A013",
    "publisher": "American Society of Mechanical Engineers",
    "publisher-place": "Virtual, Online",
    "source": "DOI.org (Crossref)",
    "title": "Analysis of the Knowledge Gain and Cognitive Load Experienced Due to the Computer-Aided Instruction of Additive Manufacturing Processes",
    "type": "paper-conference",
    "URL": "https://asmedigitalcollection.asme.org/IDETC-CIE/proceedings/IDETC-CIE2021/85406/V004T04A013/1128084"
  },
  {
    "id": "mathurEffects2023",
    "abstract": "Although the additive manufacturing (AM) market continues to grow, industries face barriers to AM adoption due to a shortage of skilled designers in the workforce that can apply AM effectively to meet this demand. This shortage is attributed to the high cost and infrastructural requirements of introducing high- barrier-to-entry AM processes such as powder bed fusion (PBF) into in-person learning environments. To meet the demands for a skilled AM workforce, it is important to explore other mediums of AM education, such as computer-aided instruction (CAI) and virtual reality (VR), which can increase access to hands-on learning experiences for inaccessible AM processes. However, limited work compares virtual and physical AM instruction or explores how the differences in immersion and presence between mediums can affect the knowledge gained and the mental effort exerted when learning about different AM processes. To address this gap in the literature, this research evaluates the use of CAI, VR, and in-person instruction in AM process education when learning about material extrusion (ME) and PBF. Our findings show that the differences in immersion and presence between CAI, VR, and in-person instruction do not have a statistically significant effect when learning about ME, but do have a significant effect when learning about PBF. Specifically, we found that VR generally yields equivalent effects in knowledge gain and cognitive load to in-person PBF education while offering advantages in both metrics over CAI learning. The findings from this work thus have significant implications for using VR as an alternative to in-person training to improve designer development in process-centric AM education of typically high-barrier-to-entry AM processes.",
    "accessed": { "date-parts": [[2023, 2, 10]] },
    "author": [
      { "family": "Mathur", "given": "Jayant" },
      { "family": "Miller", "given": "Scarlett R." },
      { "family": "Simpson", "given": "Timothy W." },
      { "family": "Meisel", "given": "Nicholas A." }
    ],
    "citation-key": "mathurEffects2023",
    "container-title": "3D Printing and Additive Manufacturing",
    "DOI": "10.1089/3dp.2022.0180",
    "ISSN": "2329-7662",
    "issued": { "date-parts": [[2023, 2, 3]] },
    "license": "All rights reserved",
    "publisher": "Mary Ann Liebert, Inc., publishers",
    "source": "liebertpub.com (Atypon)",
    "title": "Effects of Immersion on Knowledge Gain and Cognitive Load in Additive Manufacturing Process Education",
    "type": "article-journal",
    "URL": "https://www.liebertpub.com/doi/10.1089/3dp.2022.0180"
  },
  {
    "id": "mathurIdentifying2022",
    "abstract": "The demand for additive manufacturing (AM) continues to grow as more industries look to integrate the technology into their product development. However, there is a deficit of designers skilled to innovate with this technology due to challenges in supporting designers with tools and education for their development in design for AM (DfAM). There is a need to introduce intuitive tools and knowledge to enable future designers to DfAM. Immersive virtual reality (VR) shows promise to serve as an intuitive tool for DfAM to aid designers during design evaluation. The goal of this research is to, therefore, identify the effects of immersion in design evaluation and study how evaluating designs for DfAM between mediums that vary in immersion, affects the results of the DfAM evaluation and the mental effort experienced from evaluating the designs. Our findings suggest that designers can use immersive and non-immersive mediums for DfAM evaluation without experiencing significant differences in the outcomes of the evaluation and the cognitive load experienced from conducting the evaluation. The findings from this work thus have implications for how industries can customize product and designer-talent development using modular design evaluation systems that leverage capabilities in immersive and non-immersive DfAM evaluation.",
    "accessed": { "date-parts": [[2022, 11, 14]] },
    "author": [
      { "family": "Mathur", "given": "Jayant" },
      { "family": "Miller", "given": "Scarlett R." },
      { "family": "Simpson", "given": "Timothy W." },
      { "family": "Meisel", "given": "Nicholas A." }
    ],
    "citation-key": "mathurIdentifying2022",
    "container-title": "Volume 5: 27th Design for Manufacturing and the Life Cycle Conference (DFMLC)",
    "DOI": "10.1115/detc2022-90063",
    "event-place": "St. Louis, Missouri, USA",
    "event-title": "ASME 2022 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference",
    "ISBN": "978-0-7918-8625-0",
    "issued": { "date-parts": [[2022, 8, 14]] },
    "license": "All rights reserved",
    "page": "V005T05A003",
    "publisher": "American Society of Mechanical Engineers",
    "publisher-place": "St. Louis, Missouri, USA",
    "source": "DOI.org (Crossref)",
    "title": "Identifying the Effects of Immersion on Design for Additive Manufacturing Evaluation of Designs of Varying Manufacturability",
    "type": "paper-conference",
    "URL": "https://asmedigitalcollection.asme.org/IDETC-CIE/proceedings/IDETC-CIE2022/86250/V005T05A003/1150496"
  },
  {
    "id": "mathurQuality2020",
    "abstract": "This paper proposes an augmented reality (AR) framework and tool on smartphones as an alternative to conventional inspection for AM parts. The framework attempts to introduce the rapid inspection potential of smartphone based AR within manufacturing by leveraging the manufacturing capability of additive manufacturing (AM) to integrate markers onto AM parts. The key step from this framework that is explored in this paper is the design and quality assessment of AM markers for marker registration. As part of the marker design and quality assessment objectives, this research conducts an evaluation on the effects of different AM processes on the quality of augmentation achieved from AM fiducial markers. Furthermore, it evaluates the minimum fiducial pattern size that on integration onto AM parts will be viable for augmentation. The results suggest that the AM process and the size of the fiducial pattern play a significant role in determining the quality of the AM markers. The paper concludes by stating that dual material extrusion AM markers provide the highest number of detectable features and therefore the highest quality of AM markers, and the smallest viable fiducial pattern for Cybercode/QR code marker can be sized at 19 × 19mm2.",
    "accessed": { "date-parts": [[2022, 11, 4]] },
    "author": [
      { "family": "Mathur", "given": "Jayant" },
      { "family": "Basu", "given": "Saurabh" },
      { "family": "Menold", "given": "Jessica" },
      { "family": "Meisel", "given": "Nicholas A." }
    ],
    "citation-key": "mathurQuality2020",
    "container-title": "Volume 11A: 46th Design Automation Conference (DAC)",
    "DOI": "10.1115/detc2020-22172",
    "event-place": "Virtual, Online",
    "event-title": "ASME 2020 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference",
    "ISBN": "978-0-7918-8400-3",
    "issued": { "date-parts": [[2020, 8, 17]] },
    "license": "All rights reserved",
    "page": "V11AT11A024",
    "publisher": "American Society of Mechanical Engineers",
    "publisher-place": "Virtual, Online",
    "source": "DOI.org (Crossref)",
    "title": "Quality Assessment of Additively Manufactured Fiducial Markers to Support Augmented Reality-Based Part Inspection",
    "type": "paper-conference",
    "URL": "https://asmedigitalcollection.asme.org/IDETC-CIE/proceedings/IDETC-CIE2020/84003/Virtual,%20Online/1090204"
  }
]
